---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoutingCriterionBase
source: html/21b201e5-4bd6-e689-fc92-7bf0249a70d2.htm
---
# RoutingCriterionBase Members

Releases all resources used by the RoutingCriterionBase